# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'erlang'
brew 'git'
brew 'go'
brew 'hub'
brew 'mackup'
brew 'mas'
brew 'mongodb'
brew 'nginx'
brew 'ngrep'
brew 'node'
brew 'openssl'
brew 'trash'
brew 'tree'
brew 'wget'

# Development
cask 'intellij-idea'
cask 'postman'

# Apps
cask 'atom'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'java'
cask 'spotify'
cask 'sublime-text'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'LastPass', id: 926036361
mas 'Slack', id: 803453959
mas 'Kindle', id: 405399194
